[
    {
        "heading_id": 1,
        "heading_name": "RAMA’S INITIATION ",
        "heading_content": [
            {
                "paragraph_id": 1,
                "paragraph_content": " The new assembly hall, Dasaratha’s latest pride, was crowded all  day with visiting dignitaries, royal emissaries, and citizens coming in with  representations or appeals for justice. The King was always accessible,  and fulfilled his duties as the ruler of Kosala without grudging the hours  spent in public service. "
            },
            {
                "paragraph_id": 2,
                "paragraph_content": " On a certain afternoon, messengers at the gate came running in to  announce, “Sage Viswamithra.” When the message was relayed to the  King, he got up and hurried forward to receive the visitor. Viswamithra,  once a king, a conqueror, and a dreaded name until he renounced his  kingly role and chose to become a sage (which he accomplished through  severe austerities), combined in himself the sage’s eminence and the  king’s authority and was quick tempered and positive. Dasaratha led him  to a proper seat and said, “This is a day of glory for us; your gracious  presence is most welcome. You must have come from afar. Would you  first rest?” "
            },
            {
                "paragraph_id": 3,
                "paragraph_content": " “No need,” the sage replied simply. He had complete mastery over  his bodily needs through inner discipline and austerities, and was above  the effects of heat, cold, hunger, fatigue, and even decrepitude. The King  later asked politely, “Is there anything I can do?” Viswamithra looked  steadily at the King and answered, “Yes. I am here to ask of you a favour.  I wish to perform, before the next full moon, a yagna at Sidhasrama.  Doubtless you know where it is?” "
            },
            {
                "paragraph_id": 4,
                "paragraph_content": " “I have passed that sacred ground beyond the Ganges many times.”  The sage interrupted. “But there are creatures hovering about  waiting to disturb every holy undertaking there, who must be overcome in  the same manner as one has to conquer the fivefold evils4 within before  one can realize holiness. Those evil creatures are endowed with  immeasurable powers of destruction. But it is our duty to pursue our aims  undeterred. The yagna I propose to perform will strengthen the beneficial  forces of this world, and please the gods above.” "
            },
            {
                "paragraph_id": 5,
                "paragraph_content": " “It is my duty to protect your sublime effort. Tell me when, and I will  be there.” "
            },
            {
                "paragraph_id": 6,
                "paragraph_content": " The sage said, “No need to disturb your august self. Send your son  Rama with me, and he will help me. He can.” "
            },
            {
                "paragraph_id": 7,
                "paragraph_content": " “Rama!” cried the King, surprised, “When I am here to serve you.”  Viswamithra’s temper was already stirring. “I know your greatness,” he  said, cutting the King short. “But I want Rama to go with me. If you are not  willing, you may say so.” "
            },
            {
                "paragraph_id": 8,
                "paragraph_content": " The air became suddenly tense. The assembly, the ministers and  officials, watched in solemn silence. The King looked miserable. “Rama is  still a child, still learning the art sand practising the use of arms.” His  sentences never seemed to conclude, but trailed away as he tried to  explain. “He is a boy, a child, he is too young and tender to contend with  demons.” "
            },
            {
                "paragraph_id": 9,
                "paragraph_content": " “But I know Rama,” was all that Viswamithra said in reply. "
            },
            {
                "paragraph_id": 10,
                "paragraph_content": " “I can send you an army, or myself lead an army to guard your  performance. What can a stripling like Rama do against those terrible  forces ... ? I will help you just as I helped Indra once when he was  harassed and deprived of his kingdom.” "
            },
            {
                "paragraph_id": 11,
                "paragraph_content": " Viswamithra ignored his speech and rose to leave. “If you cannot  send Rama, I need none else.” He started to move down the passage.  The King was too stricken to move. When Viswamithra had gone half way,  he realized that the visitor was leaving unceremoniously and was not even  shown the courtesy of being escorted to the door. Vasishtha, the King’s  priest and guide, whispered to Dasaratha, “Follow him and call him back,”  and hurried forward even before the King could grasp what he was saying.  He almost ran as Viswamithra had reached the end of the hall and,  blocking his way, said, “The King is coming; please don’t go. He did not  mean ...” "
            },
            {
                "paragraph_id": 12,
                "paragraph_content": " A wry smile played on Viswamithra’s face as he said without any  trace of bitterness, “Why are you or anyone agitated? I came here for a  purpose; it has failed; no reason to prolong my stay.” "
            },
            {
                "paragraph_id": 13,
                "paragraph_content": " “Oh, eminent one, you were yourself a king once.” "
            },
            {
                "paragraph_id": 14,
                "paragraph_content": " “What has that to do with us now?” asked Viswamithra, rather irked,  since he hated all reference to his secular past and wanted always to be  known as a Brahma Rishi. "
            },
            {
                "paragraph_id": 15,
                "paragraph_content": " Vasishtha answered mildly, “Only to remind you of an ordinary  man’s feelings, especially a man like Dasaratha who had been childless  and had to pray hard for an issue....” "
            },
            {
                "paragraph_id": 16,
                "paragraph_content": " “Well, it may be so, great one; I still say that I came on a mission  and wish to leave, since it has failed.” "
            },
            {
                "paragraph_id": 17,
                "paragraph_content": " “It has not failed,” said Vasishtha, and just then the King came up to  join them in the passage; the assembly was on its feet. "
            },
            {
                "paragraph_id": 18,
                "paragraph_content": " Dasaratha made a deep obeisance and said, “Comeback to your seat,  Your Holiness.” "
            },
            {
                "paragraph_id": 19,
                "paragraph_content": " “For what purpose, Your Majesty?” Viswamithra asked. "
            },
            {
                "paragraph_id": 20,
                "paragraph_content": " “Easier to talk seated ...” "
            },
            {
                "paragraph_id": 21,
                "paragraph_content": " “I don’t believe in any talk,” said Viswamithra; but Vasishtha pleaded  with him until he returned to his seat. "
            },
            {
                "paragraph_id": 22,
                "paragraph_content": " When they were all seated again, Vasishtha addressed the King:  “There must be a divine purpose working through this seer, who may know  but will not explain. It is a privilege that Rama’s help should be sought. Do  not bar his way. Let him go with the sage.” "
            },
            {
                "paragraph_id": 23,
                "paragraph_content": " “When, oh when?” the King asked anxiously. "
            },
            {
                "paragraph_id": 24,
                "paragraph_content": " “Now,” said Viswamithra. The King looked woebegone and "
            },
            {
                "paragraph_id": 25,
                "paragraph_content": " desperate, and the sage relented enough to utter a word of comfort. “You  cannot count on the physical proximity of someone you love, all the time.  A seed that sprouts at the foot of its parent tree remains stunted until it is  transplanted. Rama will be in my care, and he will be quite well. But  ultimately, he will leave me too. Every human being, when the time comes,  has to depart and seek his fulfilment in his own way.” "
            },
            {
                "paragraph_id": 26,
                "paragraph_content": " “Sidhasrama is far away ... ?” began the King. "
            },
            {
                "paragraph_id": 27,
                "paragraph_content": " “I’ll ease his path for him, no need for a chariot to take us there,”  said Viswamithra reading his mind. "
            },
            {
                "paragraph_id": 28,
                "paragraph_content": " “Rama has never been separated from his brother Lakshmana. May  he also go with him?” pleaded the King, and he looked relieved when he  heard Viswamithra say, “Yes, I will look after both, though their mission  will be to look after me. Let them get ready to follow me; let them select  their favourite weapons and prepare to leave.” "
            },
            {
                "paragraph_id": 29,
                "paragraph_content": " Dasaratha, with the look of one delivering hostages into the hand of  an enemy, turned to his minister and said, “Fetch my sons.” "
            },
            {
                "paragraph_id": 30,
                "paragraph_content": " Following the footsteps of their master like his shadows, Rama and  Lakshmana went past the limits of the city and reached the Sarayu River,  which bounded the capital on the north. When night fell, they rested at a  wooded grove and at dawn crossed the river. When the sun came over  the mountain peak, they reached a pleasant grove over which hung, like  a canopy, fragrant smoke from numerous sacrificial fires. Viswamithra  explained to Rama, “This is where God Shiva meditated once upon a time  and reduced to ashes the god of love when he attempted to spoil his  meditation. From time immemorial saints praying to Shiva come here to  perform their sacrifices, and the pall of smoke you notice is from their  sacrificial fires.” "
            },
            {
                "paragraph_id": 31,
                "paragraph_content": " A group of hermits emerged from their seclusion, received "
            },
            {
                "paragraph_id": 32,
                "paragraph_content": " Viswamithra, and invited him and his two disciples to stay with them for  the night. Viswamithra resumed his journey at dawn and reached a desert  region at midday. The mere expression “desert” hardly conveys the  absolute aridity of this land. Under a relentless sun, all vegetation had  dried and turned to dust, stone and rock crumbled into powdery sand,  which lay in vast dunes, stretching away to the horizon. Here every inch  was scorched and dry and hot beyond imagination. The ground was  cracked and split, exposing enormous fissures everywhere. The  distinction between dawn, noon, and evening did not exist here, as the  sun seemed to stay overhead and burn the earth without moving.  Bleached bones lay where animals had perished, including those of  monstrous serpents with jaws open in deadly thirst; into these enormous  jaws had rushed (says the poet) elephants desperately seeking shade, all  dead and fossilized, the serpent and the elephant alike. Heat haze rose  and singed the very heavens. While traversing this ground, Viswamithra  noticed the bewilderment and distress on the faces of the young men, and  transmitted to them mentally two mantras (called “Bala” and “Adi-Bala”).  When they meditated on and recited these incantations, the arid  atmosphere was transformed for the rest of their passage and they felt as  if they were wading through a cool stream with a southern summer breeze  blowing in their faces. Rama, ever curious to know the country he was  passing through, asked, “Why is this land so terrible? Why does it seem  accursed?” "
            },
            {
                "paragraph_id": 33,
                "paragraph_content": " “You will learn the answer if you listen to this story—of a woman  fierce, ruthless, eating and digesting all living creatures, possessing the  strength of a thousand mad elephants. "
            }
        ]
    },
    {
        "heading_id": 2,
        "heading_name": "THATAKA’S STORY ",
        "heading_content": [
            {
                "paragraph_id": 1,
                "paragraph_content": " The woman I speak of was the daughter of Suketha, a yaksha, a  demigod of great valour, might, and purity. She was beautiful and full of  wild energy. When she grew up she was married to a chieftain named  Sunda. Two sons were "
            },
            {
                "paragraph_id": 2,
                "paragraph_content": " born to them—Mareecha and Subahu—who were endowed with "
            },
            {
                "paragraph_id": 3,
                "paragraph_content": " enormous supernatural powers in addition to physical strength; and in  their conceit and exuberance they laid waste their surroundings. Their  father, delighted at their pranks and infected by their mood, joined in their  activities. He pulled out ancient trees by their roots and flung them about,  and he slaughtered all creatures that came his way. This depredation  came to the notice of the great savant Agasthya (the diminutive saint who  once, when certain demoniac beings hid themselves at the bottom of the  sea and Indra appealed for his help to track them, had sipped off the  waters of the ocean). Agasthya had his hermitage in this forest, and when  he noticed the destruction around, he cursed the perpetrator of this deed  and Sunda fell dead. When his wife learnt of his death, she and her sons  stormed in, roaring revenge on the saint. He met their challenge by  cursing them. “Since you are destroyers of life, may you become asuras  and dwell in the nether worlds.” (Till now they had been demigods. Now  they were degraded to demonhood.) The three at once underwent a  transformation; their features and stature became forbidding, and their  natures changed to match. The sons left to seek the company of super  demons. The mother was left alone and lives on here, breathing fire and  wishing everything ill. Nothing flourishes here; only heat and sand remain.  She is a scorcher. She carries a trident with spikes; a cobra entwined on  her arm is her armlet. The name of this fearsome creature is Thataka. Just  as the presence of a little loba (meanness) dries up and disfigures a whole  human personality, so does the presence of this monster turn into desert  a region which was once fertile. In her restlessness she constantly  harasses the hermits at their prayers; she gobbles up anything that moves  and sends it down her entrails. "
            },
            {
                "paragraph_id": 4,
                "paragraph_content": " Touching the bow slung on his shoulder, Rama asked, “Where is  she to be found?” "
            },
            {
                "paragraph_id": 5,
                "paragraph_content": " Before Viswamithra could answer, she arrived, the ground rocking  under her feet and a storm preceding her. She loomed over them with her  eyes spitting fire, her fangs bared, her lips parted revealing a cavernous  mouth; and her brows twitching in rage. She raised her trident and roared,  “In this my kingdom, I have crushed out the minutest womb of life and you  have been sent down so that I may not remain hungry.” "
            },
            {
                "paragraph_id": 6,
                "paragraph_content": " Rama hesitated; for all her evil, she was still a woman. How could  he kill her? Reading his thoughts, Viswamithra said, “You shall not  consider her a woman at all. Such a monster must receive no "
            },
            {
                "paragraph_id": 7,
                "paragraph_content": " consideration. Her strength, ruthlessness, appearance, rule her out of that  category. Formerly God Vishnu himself killed Kyathi, the wife of Brigu,  who harboured the asuras fleeing his wrath, when she refused to yield  them. Mandorai, a woman bent upon destroying all the worlds, was  vanquished by Indra and he earned the gratitude of humanity. These are  but two instances. A woman of demoniac tendencies loses all "
            },
            {
                "paragraph_id": 8,
                "paragraph_content": " consideration to be treated as a woman. This Thataka is more dreadful  than Yama, the god of death, who takes a life only when the time is ripe.  But this monster, at the very scent of a living creature, craves to kill and  eat. Do not picture her as a woman at all. You must rid this world of her.  It is your duty.” "
            },
            {
                "paragraph_id": 9,
                "paragraph_content": " Rama said, “I will carry out your wish.” "
            },
            {
                "paragraph_id": 10,
                "paragraph_content": " Thataka threw her three-pronged spear at Rama. As it came "
            },
            {
                "paragraph_id": 11,
                "paragraph_content": " flaming, Rama strung his bow and sent an arrow which broke it into  fragments. Next she raised a hail of stone sunder which to crush her  adversaries. Rama sent up his arrows, which shielded them from the  attack. Finally Rama’s arrow pierced her throat and ended her career;  thereby also inaugurating Rama’s life’s mission of destroying evil and  demonry in this world. The gods assembled in the sky and expressed their  joy and relief and enjoined Viswamithra,“Oh, adept and master of  weapons, impart without any reserve all your knowledge and powers to  this lad. He is a saviour.” Viswamithra obeyed this injunction and taught  Rama all the esoteric techniques in weaponry. Thereafter the presiding  deities of various weapons, asthras, appeared before Rama submissively  and declared, “Now we are yours; command us night or day.” "
            },
            {
                "paragraph_id": 12,
                "paragraph_content": " When they reached a mist-covered wood on a mountain, Viswamithra told  another story. "
            }
        ]
    },
    {
        "heading_id": 3,
        "heading_name": "MAHABALI’S STORY ",
        "heading_content": [
            {
                "paragraph_id": 1,
                "paragraph_content": " This is consecrated ground where Vishnu once sat in meditation.  (Although Rama was Vishnu, his human incarnation made him unaware  of his identity at the moment.) While Vishnu was thus engaged, Mahabali  seized the earth and heaven and brought them under his subjection. He  celebrated his victory by performing a great yagna, and used this occasion  to invite and honour all learned men. All the gods who had suffered in their  encounter with Mahabali arrived in a body at the spot where Vishnu was  in meditation and begged him to help them regain their kingdoms. In  response to their appeals, Vishnu took birth in a brahmin family as a  person of tiny proportions; within this diminutive personality was packed a  great deal of power and learning. Mahabali was quick to sense his  greatness when this dwarfish man presented himself at the palace gate.   Mahabali received the visitor warmly and respectfully. "
            },
            {
                "paragraph_id": 2,
                "paragraph_content": " The visitor said, “I have come from afar after hearing of your  greatness. My ambition in life has been to have a glimpse of one who is  renowned alike for his valour and generosity. Now, after meeting you, I  have attained my life’s ambition. Achievements such as yours cannot be  measured. When a poor man like me has a glimpse of your divinity, a part  of it comes to me also.” "
            },
            {
                "paragraph_id": 3,
                "paragraph_content": " “Oh great one, do not praise me,” Mahabali replied. “I am after all a  fighter and conqueror—base qualities when compared to the learning and  special attainments of one like you. I am not easily led by appearances. I  can know how great you must be. I shall be happy if you will accept a gift  in return for the honour you have done in visiting me.” "
            },
            {
                "paragraph_id": 4,
                "paragraph_content": " “I want nothing. I need no gift other than your goodwill.” "
            },
            {
                "paragraph_id": 5,
                "paragraph_content": " “No, please don’t go, ask for something, mention anything you want.  It will please me to grant it.” "
            },
            {
                "paragraph_id": 6,
                "paragraph_content": " “If you insist, then give me a piece of land.” "
            },
            {
                "paragraph_id": 7,
                "paragraph_content": " “Yes, choose it wherever you like.” "
            },
            {
                "paragraph_id": 8,
                "paragraph_content": " “Not more than what would be measured in three strides of my feet ...”  Bali laughed, looked him up and down, and said, “Is that all?”  “Yes.” "
            },
            {
                "paragraph_id": 9,
                "paragraph_content": " “I shall now ... ,” began Mahabali, but before he could complete his  sentence, his guru Sukracharya interrupted to warn, “King, do not be rash.  The small figure you see is a deception: he is minute, but this microcosm  ...” "
            },
            {
                "paragraph_id": 10,
                "paragraph_content": " “Oh, stop! I know my responsibility. To give while one can is the right  time, and to prevent a gift is an unholy act, unworthy of you. He who is  selfish is never worse than the one who stays the hand that is about to  give. Don’t stop me,” he said; and poured out a little water from a vessel  on the upturned palm of the little man to seal his promise. (It is found in  some texts that at this moment Sukracharya assumed the size of a bee  and flew into the spout of the vessel in order to block the flow of water and  thus prevent the oath being given. The dwarf, sensing this, took a sharp  dharba grass and thrust it in to clear the obstruction and it pricked the eye  of Sukracharya, who thereafter came to beknown as the one-eyed  savant.) Pouring this oblation of water, Bali said to the little man, “Now  measure and take your three steps of earth.” "
            },
            {
                "paragraph_id": 11,
                "paragraph_content": " The moment the water fell on his hand, this person, who was a figure  of fun even to his parents till then, assumed a majestic stature spanning  the earth and the sky. With the first step he measured the entire earth,  with the second he covered the heavens. No more space was left in the  whole universe, and he asked Mahabali, “Where shall I place the third  step?” "
            },
            {
                "paragraph_id": 12,
                "paragraph_content": " Mahabali, overawed, knelt, bowed, and said, “Here on my head, if  no other space is available.” Vishnu raised his foot, placed it on Mahabali’s  head, and pressed him down to the netherworld. “You may stay there,” he  said, and thus disposed of the tormentor of the worlds. "
            },
            {
                "paragraph_id": 13,
                "paragraph_content": " Concluding the story, Viswamithra announced, “This is the end of our  journey for the time being. Here I will perform the sacrifices under your  protection.” "
            },
            {
                "paragraph_id": 14,
                "paragraph_content": " In due course Viswamithra gathered a good company of saints and  made preparations for the yagna, Rama and Lakshmana guarding the  ground. Meanwhile the asuras assembled in the skies above the holy  ground, ready to disrupt the yagna. The demons were armed with a variety  of deadly weapons; they shrieked and howled and attempted in other  ways to create confusion. They flung boiling water and offal on the holy  ground; uttered menaces, curses, and blasphemies; tore out huge rocks  and flung them down; and set in force terrifying magical disturbances.  The saints looked distraught. Rama advised the sages, “Do not feel  disturbed. Proceed with your prayers.” "
            },
            {
                "paragraph_id": 15,
                "paragraph_content": " Lakshmana said to Rama, “I will deal with them.” He shot at them,  while Rama sent up his arrows and created an umbrella to shield the  sacrificial fire from being defiled by the asuras’ blood. Subahu and  Mareecha, the sons of Thataka thought this their best chance to avenge  the death of their mother and aimed their attack at Rama, whose first shot  carried Mareecha far out and threw him into the sea; the second one  eliminated Subahu. The demons who had gathered with such zest  withdrew in panic. "
            },
            {
                "paragraph_id": 16,
                "paragraph_content": " The sacrifice was successfully accomplished. Viswamithra "
            },
            {
                "paragraph_id": 17,
                "paragraph_content": " declared, “Rama, you alone could help me in this task. This was  performed not for my personal satisfaction, but for the good of humanity  itself.” "
            },
            {
                "paragraph_id": 18,
                "paragraph_content": " Rama asked, “What next?” "
            },
            {
                "paragraph_id": 19,
                "paragraph_content": " Viswamithra said, “You have accomplished much now. There is a  great deal yet ahead of you,” hinting at the tasks that Rama would have  to fulfil in this incarnation. “For the present let us proceed towards Mithila  City, where a great yagna is to be performed by King Janaka, and where  many others will be arriving; you may enjoy this diversion.” Although he  suggested this step as a sort of relaxation for Rama, he knew by foresight  that it was but the beginning of a great series of events in which Rama’s  future would be involved. "
            },
            {
                "paragraph_id": 20,
                "paragraph_content": " At the end of a day’s journeying, they arrived at a valley where the  Ganges was flowing. “There you see,” said Viswamithra, “the river Ganga,  the holiest river in the world, starting from the Himalayas, running her  course through mountains and valleys and across several kingdoms.  Today she flows along peacefully, but at the beginning ... Now listen to  her story.” "
            }
        ]
    },
    {
        "heading_id": 4,
        "heading_name": "GANGA’S STORY ",
        "heading_content": [
            {
                "paragraph_id": 1,
                "paragraph_content": " Every inch of ground on earth, as you may have realized by now,  has a divine association. Mother Earth has been there since the beginning  of creation, being one of the five primeval elements. She has seen  countless pairs of feet running about on thousands of aims and pursuits,  both evil and good, and will continue until Time (“Kala”) swallows and  digests everything. Even after the participants have vanished, every inch  of earth still retains the impress of all that has gone before. We attain a  full understanding only when we are aware of the divine and other  associations of every piece of ground we tread on. Otherwise it would be  like the passage of a blind man through illuminated halls and gardens.  That is the reason why I have explained to you the story of every place  we have passed through. You see that river now. It is Ganga flowing along  the valley, coming down from the Himalayas, carrying within her the  essence of rare herbs and elements found on her way. She courses  through many a kingdom, and every inch of the ground she touches  becomes holy; Ganga cleanses and transforms; the dying person with a  sip of that water or with the ashes of his bones dissolved therein attains  salvation. Now you find the river serene and beautiful. But Ganga had to  be tamed and controlled before she could touch this earth; her story  involves the fate of your ancestors, very early ones. "
            },
            {
                "paragraph_id": 2,
                "paragraph_content": " Sakara, one of your ancestors, ruled the earth with great distinction  at one time. He had numerous sons, all valorous and devoted to their  father. At the proper time in his career, he planned to perform a very  important sacrifice—the “Horse Sacrifice.” "
            },
            {
                "paragraph_id": 3,
                "paragraph_content": " In preparation for this ceremony a resplendent horse fully "
            },
            {
                "paragraph_id": 4,
                "paragraph_content": " caparisoned and decorated is set free and trots along at will through the  frontiers of many kingdoms, and every country that lets the horse pass  through is considered to have accepted the suzerainty of the horse’s  owner. But if at any point anyone attempts to hold up the horse, it is taken  as a challenge and causes a war; the original owner of the horse attacks  the country where the horse is held and sets it free again, and again and  again until it gets through and returns home. Then all the countries  through which it has passed become vassals of the king, and the king  celebrates his victory with the great “Horse Sacrifice” which makes him  supreme lord of the earth. Those who embark on such a plan are confident  of victory and could eventually aspire to extend their empire and challenge  Indra himself. Hence Indra and all the gods are very watchful and nervous  whenever a sacrifice is planned, and do their best to defeat it.  When Sakara’s horse started out Indra abducted it and kept it out of  view in the deepest world underground, behind Sage Kapila, who had  earlier sought this seclusion far away from the earth for his spiritual  practices. When it became known that the horse was lost underground,  Sakara’s sons started digging wide and deep and went down into the  bowels of the earth. They found their horse tethered behind the man in  meditation; they seized the horse and tormented the saint, assuming that  he had stolen it; whereupon the saint with an angry glare reduced them to  ashes. One of the party survived this expedition, a grandson of the  emperor; he apologized to the sage and came home and helped the old  king to complete his “Horse Sacrifice.” Later, King Sakara renounced the  world in favour of his grandson, whose son was Bhagiratha, responsible  for bringing the Ganges down to earth. "
            },
            {
                "paragraph_id": 5,
                "paragraph_content": " When Bhagiratha grew up and learnt of the fate of his ancestors, he  made it his mission in life to help them attain salvation, instead of leaving  their spirits dangling in mid-air without proper disposal of their remains.  He prayed intensely for ten thousand years to Brahma, the creator, who  advised him to seek the help of Shiva to bring down Ganga from high  heaven and to wash their bones in the holy water. He prayed to Shiva for  ten thousand years and he appeared and promised to grant his wishes if  he could somehow persuade Ganga to descend. And then he prayed to  Ganga for five thousand years. Ganga appeared to him in the guise of an  elegant little girl and said, “Shiva has promised you his help, no doubt, but  if Ganga descends in her full force, the earth will not bear it; nothing can  ever bear the force of her descent. Shiva agreed to help you—but find out  what his intentions are. Pray to him again.” "
            },
            {
                "paragraph_id": 6,
                "paragraph_content": " After further meditations, by Bhagiratha, Shiva again appeared and  said to him, “Let Ganga come down, I will help you. I will see that no drop  of that water is wasted or allowed to trouble anyone.” This was developing  into a series of challenges between Shiva and Ganga, and Bhagiratha  began to feel that he was being tossed between challenging gods. But  undaunted (his name is a byword for indefatigable effort), he had prayed  for thirty thousand years in all, undergoing severe austerities—such as  living on dry fallen leaves, then on air, then on sun’s rays, and in the last  stages he gave up even these and survived on practically nothing,  conscious of nothing but his own purpose and faith in his cause.  At the end of Bhagiratha’s penance, Ganga, whose origin was in the  far-off world of Brahma, the creator, started her descent in a roaring  deluge. As promised, Shiva appeared on the scene just when the deluge  was about to hit and pulverize the earth. Shiva took his stance, planted  his feet firmly, arms akimbo, and received the impact of the descent on  his head, and the threatened deluge just vanished into his tangled, matted  locks. For all the uproar and conceit that Ganga had displayed this was a  tame end—so tame and quiet indeed that Bhagiratha began to feel  uneasy. It seemed as if this was the end of Ganga and that all his prayers  and penances had produced nothing in the end. Shiva understood his  fears and let a trickle out of his hair which Bhagiratha led on carefully and  anxiously underground over his ancestors’ ashes and helped their souls  attain salvation. Thus Bhagiratha helped not only his ancestors, but all  mankind, as the Ganges bears a countless number of holy shrines on its  banks, and nourishes millions of acres of land and people along its course.  The pit dug by Sakara’s sons while searching for their horse also filled up  and became the oceans of today. "
            },
            {
                "paragraph_id": 7,
                "paragraph_content": " They arrived within sight of Mithila City. While passing over slightly  raised ground beside the walls of the fort, Rama noticed a shapeless slab  of stone, half buried vertically in the ground; when he brushed past, the  dust of his feet fell on it, and transformed it, that very instant, into a  beautiful woman. As the woman did obeisance and stood aside "
            },
            {
                "paragraph_id": 8,
                "paragraph_content": " respectfully, Viswamithra introduced her to Rama. “If you have heard of  Sage Gautama, whose curse resulted in great Indra’s body being studded  with a thousand eyes, all over ... This lady was his wife, and her name is  Ahalya.” And he told Rama her story. "
            }
        ]
    },
    {
        "heading_id": 5,
        "heading_name": "AHALYA’S STORY ",
        "heading_content": [
            {
                "paragraph_id": 1,
                "paragraph_content": " Brahma once created, out of the ingredients of absolute beauty, a  woman, and she was called Ahalya (which in the Sanskrit language  means non-imperfection). God Indra, being the highest god among the  gods, was attracted by her beauty and was convinced that he alone was  worthy of claiming her hand. Brahma, noticing the conceit and  presumptuousness of Indra, ignored him, sought out Sage Gautama, and  left him in charge of the girl. She grew up in his custody, and when the  time came the sage took her back to Brahma and handed her over to him.  Brahma appreciated Gautama’s purity of mind and heart (never once had  any carnal thought crossed his mind), and said, “Marry her, she is fit to be  your wife, or rather you alone deserve to be her husband.” Accordingly,  she was married, blessed by Brahma and other gods. Having spent her  childhood with Gautama, Ahalya knew his needs and so proved a perfect  wife, and they lived happily. "
            },
            {
                "paragraph_id": 2,
                "paragraph_content": " Indra, however, never got over his infatuation for Ahalya, and often  came in different guises near to Gautama’s ashram, waiting for every  chance to gaze and feast on Ahalya’s form and figure; he also watched  the habits of the sage and noticed that the sage left his ashram at the  dawn of each day and was away for a couple of hours at the river for his  bath and prayers. Unable to bear the pangs of love any more, Indra  decided to attain the woman of his heart by subterfuge. One day, hardly  able to wait for the sage to leave at his usual hour, Indra assumed the  voice of a rooster, and woke up the sage, who, thinking that the morning  had come, left for the river. Now Indra assumed the sage’s form, entered  the hut, and made love to Ahalya. She surrendered herself, but at some  stage realized that the man enjoying her was an imposter; but she could  do nothing about it. Gautama came back at this moment, having intuitively  felt that something was wrong, and surprised the couple in bed. Ahalya  stood aside filled with shame and remorse; Indra assumed the form of a  cat (the most facile animal form for sneaking in or out) and tried to slip  away. The sage looked from the cat to the woman and was not to be  deceived. He arrested the cat where he was with these words:  “Cat, I know you; your obsession with the female is your undoing.  May your body be covered with a thousand female marks, so that in all  the worlds, people may understand what really goes on in your mind all  the time.” Hardly had these words left his lips when every inch of Indra’s  body displayed the female organ. There could be no greater shame for  the proud and self-preening Indra. "
            },
            {
                "paragraph_id": 3,
                "paragraph_content": " After Indra slunk away, back to his world, Gautama looked at his  wife and said, “You have sinned with your body. May that body harden  into a shapeless piece of granite, just where you are... .” Now in  desperation Ahalya implored, “A grave mistake has been committed. It is  in the nature of noble souls to forgive the errors of lesser beings. Please  ... I am already feeling a weight creeping up my feet. Do something ...  please help me... .” "
            },
            {
                "paragraph_id": 4,
                "paragraph_content": " Now the sage felt sorry for her and said, “Your redemption will come  when the son of Dasaratha, Rama, passes this way at some future date...  .” "
            },
            {
                "paragraph_id": 5,
                "paragraph_content": " “When? Where?” she essayed to question, desperately, but before  the words could leave her lips she had become a piece of stone.  Indra’s predicament became a joke in all the worlds at first, but later  proved noticeably tragic. He stayed in darkness and seclusion and could  never appear before men or women. This caused much concern to all the  gods, as his multifarious duties in various worlds remained suspended,  and they went in a body to Brahma and requested him to intercede with  Gautama. By this time, the sage’s resentment had vanished. And he said  in response to Brahma’s appeal, “May the thousand additions to Indra’s  features become eyes.” Indra thereafter came to be known as the  “thousand-eyed god.” "
            },
            {
                "paragraph_id": 6,
                "paragraph_content": " Viswamithra concluded the story and addressed Rama. “O great  one, you are born to restore righteousness and virtue to mankind and  eliminate all evil. At our yagna, I saw the power of your arms, and now I  see the greatness of the touch of your feet.”  "
            },
            {
                "paragraph_id": 7,
                "paragraph_content": " Rama said to Ahalya, “May you seek and join your revered husband,  and live in his service again. Let not your heart be burdened with what is  past and gone.” "
            },
            {
                "paragraph_id": 8,
                "paragraph_content": " On their way to Mithila, they stopped to rest at Gautama’s "
            },
            {
                "paragraph_id": 9,
                "paragraph_content": " hermitage, and Viswamithra told the sage, “Your wife is restored to her  normal form, by the touch of Rama’s feet. Go and take her back, her heart  is purified through the ordeal she has undergone.” All this accomplished,  they moved on, leaving behind the scented groves and forest, and  approached the battlemented gates of Mithila City. "
            }
        ]
    }
]